{"config": [{"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200, 200, 1], "filters": 8, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "conv2d_47", "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_21", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200, 200, 1], "filters": 8, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "name": "conv2d_48", "data_format": "channels_last", "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "trainable": true, "name": "max_pooling2d_22", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "name": "dropout_31", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_11", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_37", "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 150, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_32", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_38", "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 150, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_33", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_39", "activation": "relu", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "units": 150, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_40", "activation": "sigmoid", "kernel_regularizer": null, "units": 4, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.5"}